OpenNuvoton/nuc1311bsp/Library/StdDriver/src/can.c
/**************************************************************************//**
 * @file     adc.c
 * @version  V3.01
 * @brief    NUC1311 series ADC driver source file
 *
 * @note
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "NUC1311.h"

/** @addtogroup Device_Driver NUC1311 Device Driver
  @{
*/

/** @addtogroup CAN_Driver CAN Driver
  @{
*/

/** @addtogroup CAN_EXPORTED_FUNCTIONS CAN Exported Functions
  @{
*/

/// @cond HIDDEN_SYMBOLS


#define TSEG1_MIN 2ul
#define TSEG1_MAX 16ul
#define TSEG2_MIN 1ul
#define TSEG2_MAX 8ul
#define BRP_MIN   1ul
#define BRP_MAX   1024ul  /* 6-bit BRP field + 4-bit BRPE field*/
#define SJW_MAX   4ul
#define BRP_INC   1ul

#if defined(CAN1)
static uint8_t gu8LockCanIf[2][2] = {{0U}};    /* The chip has two CANs. */
#elif defined(CAN0) || defined(CAN)
static uint8_t gu8LockCanIf[1][2] = {{0U}};    /* The chip only has one CAN. */
#endif

#define RETRY_COUNTS    (0x10000000)



static uint32_t LockIF(CAN_T *tCAN);
static uint32_t LockIF_TL(CAN_T *tCAN);
static void ReleaseIF(CAN_T *tCAN, uint32_t u32IfNo);
static int can_update_spt(int sampl_pt, int tseg, int *tseg1, int *tseg2);


//#define DEBUG_PRINTF printf
#define DEBUG_PRINTF(...)

/**
  * @brief Check if any interface is available then lock it for usage.
  * @param[in] tCAN The pointer to CAN module base address.
  * @retval 0 IF0 is free
  * @retval 1 IF1 is free
  * @retval 2 No IF is free
  * @details Search the first free message interface, starting from 0. If a interface is
  *          available, set a flag to lock the interface.
  */
static uint32_t LockIF(CAN_T *tCAN)
{
    uint32_t u32CanNo;
    uint32_t u32FreeIfNo;
    uint32_t u32IntMask;

#if defined(CAN1)
    u32CanNo = (tCAN == CAN1) ? 1 : 0;
#else // defined(CAN0) || defined(CAN)
    u32CanNo = 0U;
#endif

    u32FreeIfNo = 2U;

    /* Disable CAN interrupt */
    u32IntMask = tCAN->CON & (CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);
    tCAN->CON = tCAN->CON & ~(CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);

    /* Check interface 1 is available or not */
    if((tCAN->IF[0].CREQ & CAN_IF_CREQ_BUSY_Msk) == 0U)
    {
        if(gu8LockCanIf[u32CanNo][0] == (uint8_t)FALSE)
        {
            gu8LockCanIf[u32CanNo][0] = (uint8_t)TRUE;
            u32FreeIfNo = 0U;
        }
    }

    /* Or check interface 2 is available or not */
    if(u32FreeIfNo == 2U)
    {
        if((tCAN->IF[1].CREQ & CAN_IF_CREQ_BUSY_Msk) == 0U)
        {
            if(gu8LockCanIf[u32CanNo][1] == (uint8_t)FALSE)
            {
                gu8LockCanIf[u32CanNo][1] = (uint8_t)TRUE;
                u32FreeIfNo = 1U;
            }
        }
    }

    /* Enable CAN interrupt */
    tCAN->CON |= u32IntMask;

    return u32FreeIfNo;
}

/**
  * @brief Check if any interface is available in a time limitation then lock it for usage.
  * @param[in] tCAN The pointer to CAN module base address.
  * @retval 0 IF0 is free
  * @retval 1 IF1 is free
  * @retval 2 No IF is free
  * @details Search the first free message interface, starting from 0. If no interface is
  *          it will try again until time out. If a interface is available,  set a flag to
  *          lock the interface.
  */
static uint32_t LockIF_TL(CAN_T *tCAN)
{
    uint32_t u32Count;
    uint32_t u32FreeIfNo = 0U;

    for(u32Count = 0U; u32Count < (uint32_t)RETRY_COUNTS; u32Count++)
    {
        if((u32FreeIfNo = LockIF(tCAN)) != 2U)
        {
            break;
        }
    }

    return u32FreeIfNo;
}

/**
  * @brief Release locked interface.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32Info The interface number, 0 or 1.
  * @return none
  * @details Release the locked interface.
  */
static void ReleaseIF(CAN_T *tCAN, uint32_t u32IfNo)
{
    uint32_t u32IntMask;
    uint32_t u32CanNo;

    if(u32IfNo < 2U)
    {
#if defined(CAN1)
        u32CanNo = (tCAN == CAN1) ? 1U : 0U;
#else // defined(CAN0) || defined(CAN)
        u32CanNo = 0U;
#endif

        /* Disable CAN interrupt */
        u32IntMask = tCAN->CON & (CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);
        tCAN->CON = tCAN->CON & ~(CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);

        gu8LockCanIf[u32CanNo][u32IfNo] = (uint8_t)FALSE;

        /* Enable CAN interrupt */
        tCAN->CON |= u32IntMask;
    }
}

static int can_update_spt(int sampl_pt, int tseg, int *tseg1, int *tseg2)
{
    *tseg2 = tseg + 1 - (sampl_pt * (tseg + 1)) / 1000;
    if (*tseg2 < (int)TSEG2_MIN) {
        *tseg2 = (int)TSEG2_MIN;
    } else {
    }

    if (*tseg2 > (int)TSEG2_MAX) {
        *tseg2 = (int)TSEG2_MAX;
    } else {
    }

    *tseg1 = tseg - *tseg2;
    if (*tseg1 > (int)TSEG1_MAX) {
        *tseg1 = (int)TSEG1_MAX;
        *tseg2 = tseg - *tseg1;
    } else {
    }

    return 1000 * (tseg + 1 - *tseg2) / (tseg + 1);
}


/**
  * @brief Enter initialization mode
  * @param[in] tCAN The pointer to CAN module base address.
  * @return None
  * @details This function is used to set CAN to enter initialization mode and enable access bit timing
  *          register. After bit timing configuration ready, user must call CAN_LeaveInitMode()
  *          to leave initialization mode and lock bit timing register to let new configuration
  *          take effect.
  */
void CAN_EnterInitMode(CAN_T *tCAN)
{
    tCAN->CON |= CAN_CON_INIT_Msk;
    tCAN->CON |= CAN_CON_CCE_Msk;
}


/**
  * @brief Leave initialization mode
  * @param[in] tCAN The pointer to CAN module base address.
  * @return None
  * @details This function is used to set CAN to leave initialization mode to let
  *          bit timing configuration take effect after configuration ready.
  */
void CAN_LeaveInitMode(CAN_T *tCAN)
{
    uint32_t u32TimeOutCount = CAN_TIMEOUT;

